1/code/param/10/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile {
    format ascii;
    class dictionary;
    location "system";
    object controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
application icoFoam;
startFrom startTime;
startTime 0;
stopAt endTime;
endTime 0.5;
deltaT 0.00015625;
writeControl runTime;
writeInterval 0.1;
purgeWrite 0;
writeFormat ascii;
writePrecision 6;
writeCompression off;
timeFormat general;
timePrecision 6;
runTimeModifiable true;
// ************************************************************************* //
// functions
// {
//  #includeFunc mag(U)
//  linesample
//  {
//  type sets;
//  functionObjectLibs ('libsampling.so');
//  writeControl timeStep;
//  outputInterval 1;
// interpolationScheme cellPoint;
// setFormat raw;
// <setsFromSample--AutoReplace>
// fields (T mag(U) p);
// }
// }